web/tutorials/precice/bidirectional/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

//simulationType  RAS;
simulationType  laminar;

RAS
{
    model           LaunderSharmaKE;

    turbulence      on;

    printCoeffs     on;
}
