web/tutorials/precice/bidirectional/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../../../../library/precice_configs/of_zoomy_bidirectional.xml";

participant Fluid1;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              Fluid1-Mesh;
    patches           (outlet);
    
    readData
    (
      AlphaBack
      VelocityBack
    );
    
    writeData
    (
      Alpha
      Velocity
    );
  };
};

FF
{
  //nameP   p;
  nameAlpha alpha.water;
  nameU U;
}
